private/prose/README.org
#+TITLE: Prose Mode Configuration, in Literate Form
#+AUTHOR: Elais Jackson
#+EMAIL: elais.player@gmail.com
#+LANGUAGE: emacs-lisp
#+STARTUP: align indent fold nodlcheck hidestars oddeven hideblocks lognotestate
* Introduction
** What is this, why is it worthwhile?
+ I wanted to make a literate programming (LP) single file config for prose mode
  because I think we can all agree that if we're going to create a dedicated
  prose-mode for writers, what better way than to present the config than in a
  readable document?
+ Hopefully you'll read this in org mode and not through some other medium. This
  was meant to be renderered in that mode.
* The Meat
This is where the actual settings will go. There are quite a few things for us
to consider here. First we need to define emacs behavior after entering org-mode
(things like line wrapping, fill column, etc.), then we need to define our
functions and keybindings.

** Config
Define hooks and settings to take affect once we enter org-mode.
#+begin_src emacs-lisp :tangle "~/.emacs.d/private/prose/config.el" :noweb 

  ;; fontify code in code blocks
  (setq org-src-fontify-natively t)

  ;; enable flyspell-mode and writegood-mode when org-mode is active

  ;; text wrapping at 80 columns by default (only text)
  (add-hook 'org-mode-hook 'turn-on-auto-fill)
  (add-hook 'org-mode-hook
            '(lambda() (set-fill-column 80)))

#+end_src
#+RESULTS:

** Keybindings
Define some keybindings to activate writeroom and handle sentence navigation.
#+begin_src emacs-lisp :tangle "~/.emacs.d/private/prose/keybindings.el" :noweb
  ;; keybindings for artbollocks mode
  (evil-leader/set-key-for-mode 'artbollocks-mode
    "mmw" 'artbollocks-word-count
    "mms" 'artbollocks-sentence-count
    "mmr" 'artbollocks-readability-index
    "mme" 'artbollocks-reading-ease
    "mmg" 'artbollocks-grade-level)

  ;; keybindings for sentence navigation
  (define-key evil-normal-state-map ")" 'sn/evil-forward-sentence)
  (define-key evil-normal-state-map "(" 'sn/evil-backward-sentence)
  (define-key evil-normal-state-map "g)" 'sn/evil-forward-sentence-end)
  (define-key evil-normal-state-map "g(" 'sn/evil-backward-sentence-end)
  (define-key evil-outer-text-objects-map "S" 'sn/evil-outer-sentence)
  (define-key evil-inner-text-objects-map "S" 'sn/evil-inner-sentence)
#+end_src

#+RESULTS:
: sn/evil-inner-sentence

** Tools
I define functions here, because they are multiline, most will get their own codeblocks.
