private/prose/README.org
*** Fill and Unfill paragraph
These two functions fill and unfill the paragraph. These are useful for when
someone wants to use a mode other than org.
#+begin_src emacs-lisp :tangle "~/.emacs.d/private/prose/funcs.el" :noweb
  (defun my/unfill-paragraph (&optional region)
    "Takes a multi-line paragraph and makes it into a single line of text"
    (interactive (progn
                   (barf-if-buffer-read-only)
                   (list t)))
    (let ((fill-column (point-max)))
      (fill-paragraph nil region)))
  (bind-key "M-Q" 'my/unfill-paragraph)

  (defun my/fill-or-unfill-paragraph (&optional unfill region)
    "Fill paragraph (or Region)"
    (interactive (progn
                   (barf-if-buffer-read-only)
                   (list (if current-prefix-arg 'unfill) t)))
    (let ((fill-column (if unfill (point-max) fill-column)))
      (fill-paragraph nil region)))
  (bind-key "M-q" 'my/fill-or-unfill-paragraph)
#+end_src

#+RESULTS:
: my/fill-or-unfill-paragraph


*** TODO Projectile Integration
We're going to define novel properties here. The purpose of these are to make
lookups easier during the novel writing process. We'll be able to generate
tables for the metadata in the novel itself. These may do better if stored in
the actual novel...
#+begin_src emacs-lisp :tangle yes
#+end_src
